import { Route, Switch, BrowserRouter } from 'react-router-dom';
import Home from './Views/Home';
import Blog from './Views/Blog';
import Podcast from './Views/Podcast';
import Contacts from './Views/Contacts';
import Blogpage from './Views/Blogpage';

const App = () => {
  return (
    <main>
      <BrowserRouter>
        <Switch>
          <Route path='/' component={Home} exact />
          <Route path='/blog' component={Blog} />
          <Route path='/podcast' component={Podcast} />
          <Route path='/contacts' component={Contacts} />
          <Route path='/learn_about_hotel_management'
         render={() => <Blogpage heading= "Hotel Management la Earn Pana Mudyuma?"
         subtext="Dr. Jaykumar reveals..." 
         footnote="HOTEL MANAGEMENT | 3min read"
         content = "Dr. ஜெயக்குமார் இருபது வருஷமா பெங்களூர்ல பிரபலமான பல ஸ்டார் ஹோட்டல்களுக்கும், கஃபேஸ்கும் கன்சல்டன்டா இருக்காரு. இவர் ஒரு ஸர்டிஃபைட்(certified) ஒயின்  டேஸ்டரும் கூட. மிடில் 90'ஸ்ல இன்ஜினியரிங், மெடிக்கல் படிச்சாதான் வேலை கிடைக்கும்னு எல்லாரும் நினைச்ச காலத்துல, வேற ஏதாவது வித்தியாசமா படிக்கலாம்னு, சென்னை IHM ல ஹோட்டல் மேனேஜ்மென்ட் படிச்சிருக்கார். டூரிசம் அண்ட் ஹோட்டல் மேனேஜ்மென்ட்ல  டாக்டர் பட்டம் வாங்கினவர். இது மட்டும் இல்ல, PES யூனிவர்சிட்டி  ஹாஸ்பிடலிட்டி அண்ட் ஈவென்ட் மேனேஜ்மென்ட் டிபார்ட்மென்ட்டோட HOD யாவும் இருக்காரு."  
         content1 = "ஜெயக்குமார் படிச்ச காலத்தைவிட, இப்போ ஹோட்டல் மேனேஜ்மென்ட் துறைல நிறைய வேலை வாய்ப்புகள் இருக்குனு சொல்றாரு  ஹோட்டல் மேனேஜ்மென்ட் ஆர்வம் இருக்கும் இளைஞர்கள் உணவு அலங்காரம், போட்டோகிராஃபி (Food Decorations, Food photography) பண்ணா நல்லா சம்பாதிக்கலாம்னு சொல்றாரு. நம்ம நாட்டுல நம்ம வட்டார  சமையல் வகைகள ருசிச்சு ரெவ்யூ பண்றவங்க ரொம்ப கம்மி, அதனால நம்ம வட்டார உணவுகள நம்ம மொழிலயே  விமர்சனம் (Food Review) பண்றவங்களுக்கு வருங்காலத்துல நல்ல வேலை வாய்ப்பு இருக்குன்னு சொல்றாரு." 
         content2="முதல் முறையா ஒரு பைவ் ஸ்டார் ஹோட்டல் மேனேஜர், ஜெயக்குமார் பாடம் நடத்துறத பாத்து இம்ப்ரஸ்(impress) ஆகி, அவங்க ஹோட்டல்ல ட்ரெயினிங் கொடுக்க சொன்னாறாம். அதுவரை அவர் ஹோட்டல்களுக்கு போய் ட்ரெயினிங் கொடுத்ததோ, கிளாஸ் நடத்தினதோ இல்லயாம். ஆசிரியரா மட்டும்  இருந்த அவருக்கு கன்சல்டன்ட் வேலைய பத்தி புரியவச்சு, கடந்த  20 வருஷமா வெற்றிகரமான கன்சல்டன்டாக்கினது அந்த 15 நாள் ட்ரைனிங் தான்னு சொல்றாரு ஜெயக்குமார். "
         content3="புதுசா தொழில் தொடங்கறவங்களுக்கு உங்க அட்வைஸ் என்னனு கேட்டப்போ, 
         நம்ம என்ன வேலை செஞ்சாலும், நம்ம செஞ்ச வேலைக்கு சாட்சி அந்த வேலைக்கான டாக்குமெண்ட் தான். இந்த விஞ்ஞான உலகத்துல டாக்குமெண்ட் இல்லாம நம்ம திறமையை வெளிக்காட்ட முடியாதுன்னு சொல்றாரு. ஒரு தொழில் தொடங்க நல்ல ஐடியா வேணும். உங்களுடைய ஐடியாவ நீங்க மத்தவங்க கிட்ட பகிர்ந்துகறப்போ, கண்டிப்பா உங்க தொழில் தொடங்க ஒரு நல்ல முதலீட்டாளர் உங்களுக்கு கிடைப்பாங்கன்னு சொல்றாரு. இப்போலாம் மாணவர்கள் கொடுக்குற சிறந்த யோசனைகளுக்குதான் மார்க்கெட்ல சக்சஸ் ரேட் அதிகமாக இருக்குன்னு சொல்றாரு. 
         "
         content4="ஒரு தொழில் தொடங்கறதுக்கு முன் அந்த தொழில்ல இருந்து வெளியே வரவும் தெரிஞ்சுகிறது அவசியம்னு சொல்றாரு. தொழிலுக்கான யோசனை நம்மது, அது மூலம் நமக்கு நல்ல வருமானமும் கிடைச்சுருக்கு, இப்படி இருக்குறப்ப சில வருஷங்களுக்கு அப்புறம் அந்த தொழில் ஐடியா எல்லாருக்கும் தெரிஞ்சுடும். இல்ல, சில நேரம் அந்த தொழில் ஒர்க்அவுட் ஆகலேன்னா, எக்ஸிட் பிளான்(exit plan) பேஸ் பண்ணி அதுலருந்து நீங்களே விலகுறது நல்லது."
        content5="ஒரு சிறந்த ஆன்டர்ப்ரனூர்(Entrepreneur) ஆகணும்னா  நம்ம வட்டார மொழிகள் , இன்டர்நேஷனல் மொழிகள்ல, அவங்க துறைக்கு உதவக்கூடிய மொழிகளையும் தெரிஞ்சுக்கறது நல்லது. ஒரு வட்டாரத்துல இருக்கிற விற்பனையாளர்கள் (Vendors) கிட்ட பேசி பழகறப்பவே, அந்த வட்டார மொழி ஈஸியா கத்துக்கலாம்னு சொன்னவரு, ஹோட்டல் மேனேஜ்மென்ட் துறைல இருக்கறதால அவருக்கு 8 மொழி தெரியும்னு சொன்னாரு"
        content6="தோல்விகளுக்கு தயாரா இருக்கணும். பத்து தோல்விகளுக்கு அப்புறம் கிடைக்கற வெற்றி வாழ்க்கைல சிறந்த நம்பிக்கைய கொடுக்கும். நான் படிச்சு முடிச்சு, 4 கம்பெனில வேலை பார்த்தேன், அதுல யாருமே எனக்கு சம்பளம் தரல, அந்த ஏமாற்றத்தை தாண்டிதான் இப்போ இந்த இடத்துக்கு வந்துருக்கேன்னு சொல்றாரு. இளைஞர்கள் கண்டிப்பா அவுங்க சாதிக்கனுன்னு நினைக்கற துறைக்கு சம்மந்தமா ஸர்டிஃபிகேஷன் பண்ணனும். அது அவுங்களுக்கு வேலை கிடைக்க ஒரு ப்ளஸ் பாயிண்ட் இருக்கும்னு சொன்னாரு. "
       content7="ஸ்பென்சர் ஜான்சன் எழுதின Who moved my cheese? அவருக்கு இன்ஸ்பிரேஷனலா இருந்துச்சுன்னும் , வாழ்க்கையில நகைச்சுவை ரொம்பவே முக்கியம் அதனால சஷி தரூர் எழுதின Great Indian novel புக் எனக்கு பிடிச்சது, நீங்களும் வாசிச்சுப் பாருங்கன்னு நம்ம ரீடர்ஸ்க்கு சொல்றாரு"
       content8="நம்மள தேடி வர வாய்ப்புகள், நமக்கு பழக்கம் இல்லாததா இருந்தா கூட ட்ரை பண்ணி பாக்கணும். அதுவே நம்ம வாழ்க்கைல ஒரு நல்ல திருப்பு முனையா அமையலாம். எந்த வாய்ப்பு கெடச்சாலும்  'இது நமக்கு செட் ஆகுமானு' யோசிக்காம, நம்மளால முடிஞ்சத செய்வோமேனு'  நினைக்கிறது தான் வெற்றிக்கு முதல் படி. "
      />} />         
          <Route path='/indian_education_system_with_ai' component={Blogpage} />
        </Switch>
      </BrowserRouter>
    </main>
  )
}

export default App;