import { Route, Switch, BrowserRouter } from 'react-router-dom';
import { Helmet } from "react-helmet";
import Home from './Views/Home';
import Blog from './Views/Blog';
import Podcast from './Views/Podcast';
import Contacts from './Views/Contacts';
import Blogpage from './Views/Blogpage';

const App = () => {
  return (
    <main>
      <Helmet>
        <html lang="en" />
        <title>Tamilpreneur</title>
        <meta name="description" content="Tamilpreneur is an EdTech Startup for aspiring Entrepreneurs. We also run a tamil podcast covering startup journeys of
        tamil entrepreneurs, case studies and startup jargons. Join the Tamilpreneur community for up-to-date startup news, mentorship, networking, funding and many more." />
        <meta name="keywords" content="entrepreneurship, tamil startup, Startup News, News, Podcast, startups, mentorship, networking, articles, blogs" />
     </Helmet>
      <BrowserRouter>
        <Switch>
          <Route path='/' component={Home} exact />
          <Route path='/blog' component={Blog} />
          <Route path='/podcast' component={Podcast} />
          <Route path='/contacts' component={Contacts} />
          <Route path='/learn_about_hotel_management'
            render={() => <Blogpage heading="Hotel Management la Earn Pana Mudyuma?"
              subtext="Dr. Jaykumar reveals..."
              footnote="HOTEL MANAGEMENT | 3min read"
              content="Dr. ஜெயக்குமார் இருபது வருஷமா பெங்களூர்ல பிரபலமான பல ஸ்டார் ஹோட்டல்களுக்கும், கஃபேஸ்கும் கன்சல்டன்டா இருக்காரு. இவர் ஒரு ஸர்டிஃபைட்(certified) ஒயின்  டேஸ்டரும் கூட. மிடில் 90'ஸ்ல இன்ஜினியரிங், மெடிக்கல் படிச்சாதான் வேலை கிடைக்கும்னு எல்லாரும் நினைச்ச காலத்துல, வேற ஏதாவது வித்தியாசமா படிக்கலாம்னு, சென்னை IHM ல ஹோட்டல் மேனேஜ்மென்ட் படிச்சிருக்கார். டூரிசம் அண்ட் ஹோட்டல் மேனேஜ்மென்ட்ல  டாக்டர் பட்டம் வாங்கினவர். இது மட்டும் இல்ல, PES யூனிவர்சிட்டி  ஹாஸ்பிடலிட்டி அண்ட் ஈவென்ட் மேனேஜ்மென்ட் டிபார்ட்மென்ட்டோட HOD யாவும் இருக்காரு."
              content1="ஜெயக்குமார் படிச்ச காலத்தைவிட, இப்போ ஹோட்டல் மேனேஜ்மென்ட் துறைல நிறைய வேலை வாய்ப்புகள் இருக்குனு சொல்றாரு  ஹோட்டல் மேனேஜ்மென்ட் ஆர்வம் இருக்கும் இளைஞர்கள் உணவு அலங்காரம், போட்டோகிராஃபி (Food Decorations, Food photography) பண்ணா நல்லா சம்பாதிக்கலாம்னு சொல்றாரு. நம்ம நாட்டுல நம்ம வட்டார  சமையல் வகைகள ருசிச்சு ரெவ்யூ பண்றவங்க ரொம்ப கம்மி, அதனால நம்ம வட்டார உணவுகள நம்ம மொழிலயே  விமர்சனம் (Food Review) பண்றவங்களுக்கு வருங்காலத்துல நல்ல வேலை வாய்ப்பு இருக்குன்னு சொல்றாரு."
              content2="முதல் முறையா ஒரு பைவ் ஸ்டார் ஹோட்டல் மேனேஜர், ஜெயக்குமார் பாடம் நடத்துறத பாத்து இம்ப்ரஸ்(impress) ஆகி, அவங்க ஹோட்டல்ல ட்ரெயினிங் கொடுக்க சொன்னாறாம். அதுவரை அவர் ஹோட்டல்களுக்கு போய் ட்ரெயினிங் கொடுத்ததோ, கிளாஸ் நடத்தினதோ இல்லயாம். ஆசிரியரா மட்டும்  இருந்த அவருக்கு கன்சல்டன்ட் வேலைய பத்தி புரியவச்சு, கடந்த  20 வருஷமா வெற்றிகரமான கன்சல்டன்டாக்கினது அந்த 15 நாள் ட்ரைனிங் தான்னு சொல்றாரு ஜெயக்குமார். "
              content3="புதுசா தொழில் தொடங்கறவங்களுக்கு உங்க அட்வைஸ் என்னனு கேட்டப்போ, 
         நம்ம என்ன வேலை செஞ்சாலும், நம்ம செஞ்ச வேலைக்கு சாட்சி அந்த வேலைக்கான டாக்குமெண்ட் தான். இந்த விஞ்ஞான உலகத்துல டாக்குமெண்ட் இல்லாம நம்ம திறமையை வெளிக்காட்ட முடியாதுன்னு சொல்றாரு. ஒரு தொழில் தொடங்க நல்ல ஐடியா வேணும். உங்களுடைய ஐடியாவ நீங்க மத்தவங்க கிட்ட பகிர்ந்துகறப்போ, கண்டிப்பா உங்க தொழில் தொடங்க ஒரு நல்ல முதலீட்டாளர் உங்களுக்கு கிடைப்பாங்கன்னு சொல்றாரு. இப்போலாம் மாணவர்கள் கொடுக்குற சிறந்த யோசனைகளுக்குதான் மார்க்கெட்ல சக்சஸ் ரேட் அதிகமாக இருக்குன்னு சொல்றாரு. 
         "
              content4="ஒரு தொழில் தொடங்கறதுக்கு முன் அந்த தொழில்ல இருந்து வெளியே வரவும் தெரிஞ்சுகிறது அவசியம்னு சொல்றாரு. தொழிலுக்கான யோசனை நம்மது, அது மூலம் நமக்கு நல்ல வருமானமும் கிடைச்சுருக்கு, இப்படி இருக்குறப்ப சில வருஷங்களுக்கு அப்புறம் அந்த தொழில் ஐடியா எல்லாருக்கும் தெரிஞ்சுடும். இல்ல, சில நேரம் அந்த தொழில் ஒர்க்அவுட் ஆகலேன்னா, எக்ஸிட் பிளான்(exit plan) பேஸ் பண்ணி அதுலருந்து நீங்களே விலகுறது நல்லது."
              content5="ஒரு சிறந்த ஆன்டர்ப்ரனூர்(Entrepreneur) ஆகணும்னா  நம்ம வட்டார மொழிகள் , இன்டர்நேஷனல் மொழிகள்ல, அவங்க துறைக்கு உதவக்கூடிய மொழிகளையும் தெரிஞ்சுக்கறது நல்லது. ஒரு வட்டாரத்துல இருக்கிற விற்பனையாளர்கள் (Vendors) கிட்ட பேசி பழகறப்பவே, அந்த வட்டார மொழி ஈஸியா கத்துக்கலாம்னு சொன்னவரு, ஹோட்டல் மேனேஜ்மென்ட் துறைல இருக்கறதால அவருக்கு 8 மொழி தெரியும்னு சொன்னாரு"
              content6="தோல்விகளுக்கு தயாரா இருக்கணும். பத்து தோல்விகளுக்கு அப்புறம் கிடைக்கற வெற்றி வாழ்க்கைல சிறந்த நம்பிக்கைய கொடுக்கும். நான் படிச்சு முடிச்சு, 4 கம்பெனில வேலை பார்த்தேன், அதுல யாருமே எனக்கு சம்பளம் தரல, அந்த ஏமாற்றத்தை தாண்டிதான் இப்போ இந்த இடத்துக்கு வந்துருக்கேன்னு சொல்றாரு. இளைஞர்கள் கண்டிப்பா அவுங்க சாதிக்கனுன்னு நினைக்கற துறைக்கு சம்மந்தமா ஸர்டிஃபிகேஷன் பண்ணனும். அது அவுங்களுக்கு வேலை கிடைக்க ஒரு ப்ளஸ் பாயிண்ட் இருக்கும்னு சொன்னாரு. "
              content7="ஸ்பென்சர் ஜான்சன் எழுதின Who moved my cheese? அவருக்கு இன்ஸ்பிரேஷனலா இருந்துச்சுன்னும் , வாழ்க்கையில நகைச்சுவை ரொம்பவே முக்கியம் அதனால சஷி தரூர் எழுதின Great Indian novel புக் எனக்கு பிடிச்சது, நீங்களும் வாசிச்சுப் பாருங்கன்னு நம்ம ரீடர்ஸ்க்கு சொல்றாரு"
              content8="நம்மள தேடி வர வாய்ப்புகள், நமக்கு பழக்கம் இல்லாததா இருந்தா கூட ட்ரை பண்ணி பாக்கணும். அதுவே நம்ம வாழ்க்கைல ஒரு நல்ல திருப்பு முனையா அமையலாம். எந்த வாய்ப்பு கெடச்சாலும்  'இது நமக்கு செட் ஆகுமானு' யோசிக்காம, நம்மளால முடிஞ்சத செய்வோமேனு'  நினைக்கிறது தான் வெற்றிக்கு முதல் படி. "
            />} />
          <Route path='/indian_education_system_with_ai'
            render={() => <Blogpage heading="AI namma Indian Education System ah maathuma?"
              subtext="Mr. Cibe Hariharan, Co-founder, Jungroo reveals..."
              footnote="ARTIFICIAL INTELLIGENCE | 3min read"
              content="ஜுங்ரூ, என்னடா பெயரே வித்யாசமா இருக்கேனு பாக்றீங்களா? ஆமாங்க, சேதுராமன் & சிபி ஹரிஹரன் சேர்ந்து ஆரம்பிச்ச ஸ்டார்டப் தான் ஜுங்ரூ. Marks, Grades தாண்டி ஒரு ஸ்டுடென்ட்க்கு என்ன தேவைன்னு யோஸிச்சு, Adaptive learning method ஆதாரமா வச்சு ஆரம்பிச்சதுதான்  ஜுங்ரூ. ஸ்டுடென்ட்ஸ்காக ஆரம்பிச்ச ஸ்டார்டப்ங்கிறதால இப்படி அட்ராக்ட்டிவ் பெயர் வெச்சிருக்காங்கனு சொன்னாரு சிபி ஹரிஹரன். சிபி ஹரிஹரன் கோவை PSG Tech-ல  படிச்சு முடிச்சுட்டு, Amazon-ல internஆ சேர்ந்து அப்பறம் employee ஆகிருக்காரு."
              content1="அவர்கிட்ட ஜுங்ரூ பத்தி கேட்டபோ,  நான் Amazon-ல educational products-ல  வேலை செஞ்சிட்டு இருந்தேன். அதனால USஓட எஜுகேஷனல் சிஸ்டம் பத்தி தெரிஞ்சுக்கிட்டேன். அப்படித்தான் என்னோட co-founder சேதுராமன் ஒர்க் பண்ணிட்டு இருந்த Teach for india கம்பெனில வாலண்டீர் பண்ணேன். ஒரு ஸ்டூடெண்ட்டுக்கு எது தெரியும்? எது தெரியலனு? கண்டுபிடிக்கிறது கஷ்டமா இருக்குனு சேதுராமன் சொன்னாரு.  நாங்க AI யூஸ் பண்ணி ஸ்டூடெண்ட்ஸுக்கு ஒரு assessment prototype ரெடி பண்ணோம். அது நல்லாவே  வேலை செஞ்சுது. அசெஸ்மென்ட் ரிசல்ட் டீச்சர்ஸ் கிட்ட குடுத்து, ஸ்டுடென்ட்க்கு தெரியாத விஷயத்தில் கவனம் செலுத்தினா நல்ல முன்னேற்றம் தெரியும்னு சொன்னப்போ, அவுங்ககிட்ட நல்ல வரவேற்பு கிடைச்சது. இதுதான் ஜுங்ரூ ஆரம்பிக்க முக்கிய காரணமா இருந்ததுனு சிபி ஹரிஹரன் சொன்னாரு."
              content2="தனி ஆளா இருந்து  ஜுங்ரூவ சேல்ஸ் பண்ண நிறைய கஷ்டம் இருந்துது. IT ல  இருக்கறதால, ஆரம்பத்துல சேல்ஸ் பத்தி எனக்கு தெரியல. ஸ்கூல்ஸ்கூட tie-up வெச்சிருக்கிற கம்பனீஸ்தான் எங்க டார்கெட். ஆரம்பத்துல 10 பேர்கிட்ட பேசினா(pitch), அதுல 3 பேர்தான் எங்க ப்ராடக்ட வாங்குவாங்க. மனுஷன் செய்யமுடியாததை, AI செய்யுமா?னு  கேட்டவங்க தான் அதிகம். அப்படி கேக்குறவங்ககிட்ட நம்பகத்தன்மை வரவைக்றதுதான் சேலஞ்சிங்கா இருந்தது. அப்படி கஷ்டப்பட்டதுக்கு , இப்போ கிட்டத்தட்ட 10000 ஸ்டுடென்ட்ஸ் எங்க ப்ராடக்ட் யூஸ் பண்றாங்க. இதுதான்  ஜுங்ரூவோட பெரிய அசீவ்மென்ட்னு சொல்றாரு."
              content3="இப்போ educational companiesதான் ஜுங்ரூவோட கஸ்டமர்ஸா இருக்காங்க.  டைரக்டா கன்ஸ்யூமர்ஸ் கிட்டயே கொண்டு போறதுதான் ஜுங்ரூ ஓட எதிர்கால திட்டம். ஒரு கிராமத்துல இருக்குற ஸ்டுடென்ட்கிட்டகூட பெருசா கத்துக்கணும்ங்கற எண்ணம் இருக்கும். அப்படிப்பட்ட பசங்ககிட்ட வெறும் இன்டர்நெட் கனெக்சன் மட்டும் இருந்தா போதும்,  ஜுங்ரூ மொபைல் அப்ளிகேஷன் டவுன்லோட் பண்ணி, அது மூலம் அவங்க  திறமையை வளர்க்கலாம். இப்படி எல்லா கன்ஸ்யூமர்ஸ் கிட்டயும்  டைரக்டா ஜுங்ரூ ரீச் ஆகணும். அதுதான் ஜுங்ரூவோட அடுத்த முயற்சி, அதுக்கான வேலைதான் பண்ணிட்டு இருக்கோம்னு,  சொன்னார்  சிபி ஹரிஹரன்."
              content4="ஜுங்ரூஓட ஆரம்ப காலத்தில Elevateங்ற இவென்ட்ல  பார்ட்டிசிபேட் பண்ணிருக்காங்க. கர்நாடகால ரிஜிஸ்டர் ஆன ஸ்டார்ட்டப்ஸ்காக, வருஷத்துக்கு ஒரு தடவ நடக்கிற இவெண்ட்தான் elevate.  ஸ்டார்ட்டப் ஆரம்பிக்க ஆசைப்படறவங்ககிட்ட, பாமர மக்கள் பிரச்சனைக்கு தீர்வு கொடுக்குற ஐடியாஸும், அவங்க Profile-ம் நல்லா இருந்தா எலிவேட் அவங்களுக்கு பைனான்ஸ் பண்றாங்க. அதுல ஜுங்ரூவோட ஐடியா வெற்றி பெற்றுருக்கு. NASSCOM இயக்கத்தோட AI for goodங்ற initiative, இந்தியாவோட சமூக பிரச்சனைகளுக்கு AI மூலம் தீர்வு சொல்றவங்களுக்கு உதவுறாங்க. இதுலையும் ஜுங்ரூ செலக்ட் ஆகிருக்கு."
              content5="நேரம் ரொம்ப முக்கியம். Entrepreneur ஆகனுன்னு ஆசப்படற யாரானாலும் சீக்கிரமா அவங்க Product வெளியிடனும். எல்லாம் செஞ்சு முடிச்சுட்டு ரிலீஸ் பண்ணினா பொதும்னு நெனச்சு, அது வெளியான அப்புறம்  மக்களுக்கு பிடிக்கலேனா நம்ம உழைப்பும், நேரமும் வீணாயிடும். ஜுங்ரூல ஒரு feature சேர்க்கனுன்னு நெனச்சு 4 மாசம் அதுக்காக வேலை பாத்துருக்காங்க.அதை ரிலீஸ் பண்ண அப்புறம்தான் தெரிஞ்சுருக்கு, அது தேவையில்லாததுனு. அந்த 4 மாசத்துல கொஞ்சம் leads convert பண்ணிருக்கலாம்னு சொன்னாரு சிபி."
              content6="Eric Ries எழுதின The Lean Startup புக்தான் அவுங்க ஜுங்ரூ ஸ்டார்ட் பண்ண உந்துதலா இருந்துருக்கு. கண்டிப்பா aspiring entrepreneurs அந்த புக் வாசிக்கணும்னு சொல்றாரு."
              content7="வாய்ப்பு கிடைக்கறப்போ, வேற எதையும் யோஸிக்காம வேலைய ஆரம்பிக்கனும்  (launch whenever possible). தோல்விக்கான பயம் தொழில் முனைவோருக்கு(entrepreneur) கண்டிப்பா இருக்கும், அதை தவிர்க்க முயற்சிக்கணும்.  கஸ்டமர்ஸ் தேவைகள சீக்கிரமா பூர்த்தி பண்றதுலதான் தொழிலோட வெற்றி இருக்கு. அதுக்கு நம்ம எப்போதுமே தயாரா இருக்கணும். இதுதான் சிபி ஹரிஹரன் entrepreneursக்கு கொடுக்கிற அட்வைஸ்."
            />} />
        </Switch>
      </BrowserRouter>
    </main>
  )
}

export default App;